taboadaa/ShuQi/nRF/Packages/.cache/Keil.STM32F4xx_DFP.2.11.0.pdsc
        <!-- *************************  Device 'STM32F410RB'  ***************************** -->
        <device Dname="STM32F410RB">
          <compile header="Drivers/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xx.h"  define="STM32F410Rx"/>
          <memory     id="IROM1"                             start="0x08000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                             start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_128.FLM"   start="0x08000000"  size="0x20000"                  default="1"/>
          <variant Dvariant="STM32F410RBTx"> <feature type="QFP" n="64"/> </variant>
          <variant Dvariant="STM32F410RBIx"> <feature type="BGA" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F410TB'  ***************************** -->
        <device Dname="STM32F410TB">
          <compile header="Drivers/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xx.h"  define="STM32F410Tx"/>
          <memory     id="IROM1"                             start="0x08000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                             start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_128.FLM"   start="0x08000000"  size="0x20000"                  default="1"/>
          <variant Dvariant="STM32F410TBYx"> <feature type="CSP" n="36"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F410C8'  ***************************** -->
        <device Dname="STM32F410C8">
          <compile header="Drivers/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xx.h"  define="STM32F410Cx"/>
          <memory     id="IROM1"                             start="0x08000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                             start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_128.FLM"   start="0x08000000"  size="0x10000"                  default="1"/>
          <variant Dvariant="STM32F410C8Ux"> <feature type="QFN" n="48"/> </variant>
          <variant Dvariant="STM32F410C8Tx"> <feature type="QFP" n="48"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F410R8'  ***************************** -->
        <device Dname="STM32F410R8">
          <compile header="Drivers/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xx.h"  define="STM32F410Rx"/>
          <memory     id="IROM1"                             start="0x08000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                             start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_128.FLM"   start="0x08000000"  size="0x10000"                  default="1"/>
          <variant Dvariant="STM32F410R8Tx"> <feature type="QFP" n="64"/> </variant>
          <variant Dvariant="STM32F410R8Ix"> <feature type="BGA" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F410T8'  ***************************** -->
        <device Dname="STM32F410T8">
          <compile header="Drivers/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xx.h"  define="STM32F410Tx"/>
          <memory     id="IROM1"                             start="0x08000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                             start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_128.FLM"   start="0x08000000"  size="0x10000"                  default="1"/>
          <variant Dvariant="STM32F410T8Yx"> <feature type="CSP" n="36"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F411'  **************************** -->
      <subFamily DsubFamily="STM32F411">
        <processor Dclock="100000000"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xx.h"  define="STM32F411xE"/>
        <debug      svd="CMSIS/SVD/STM32F411xx.svd"/>
        <debugvars configfile="CMSIS/Debug/STM32F401xBCDE_411xCE.dbgconf">
          // Debug Access Variables, can be modified by user via copy of STM32F401xBCDE_411xCE.dbgconf created by uVision.
          __var DbgMCU_CR      = 0x00000007;   // DBGMCU_CR: DBG_SLEEP, DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz = 0x00000000;   // DGBMCU_APB1_FZ
          __var DbgMCU_APB2_Fz = 0x00000000;   // DGBMCU_APB2_FZ
        </debugvars>
        <book name="Documentation/DM00119316.pdf" title="STM32F411xC/E Reference Manual"/>
        <book name="Documentation/DM00115249.pdf" title="STM32F411xC/411xE Data Sheet"/>
        <feature type="Timer"         n="6"       m="16"/>
        <feature type="I2C"           n="3"/>
        <feature type="USART"         n="3"       m="10500000"/>
        <feature type="USBOTG"        n="1"/>
        <feature type="VCC"           n="1.70"    m="3.60"/>

        <!-- *************************  Device 'STM32F411CC'  ***************************** -->
        <device Dname="STM32F411CC">
          <memory     id="IROM1"                             start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                             start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_256.FLM"   start="0x08000000"  size="0x40000"                  default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F401xx_OPT.FLM" start="0x1FFFC000"  size="0x04"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_OTP.FLM"   start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="10"      m="12"/>
          <feature type="IOs"           n="36"/>
          <feature type="SPI"           n="5"       m="45000000"/>
          <feature type="SDIO"          n="1"       m="8"               name="Secure Digital IO"/>
          <variant Dvariant="STM32F411CCUx"> <feature type="QFP" n="48"/> </variant>
          <variant Dvariant="STM32F411CCYx"> <feature type="CSP" n="49"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F411RC'  ***************************** -->
        <device Dname="STM32F411RC">
          <memory     id="IROM1"                             start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                             start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_256.FLM"   start="0x08000000"  size="0x40000"                  default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F401xx_OPT.FLM" start="0x1FFFC000"  size="0x04"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_OTP.FLM"   start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="50"/>
          <feature type="SPI"           n="5"       m="45000000"/>
          <feature type="SDIO"          n="1"       m="8"               name="Secure Digital IO"/>
          <variant Dvariant="STM32F411RCTx"> <feature type="QFP" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F411VC'  ***************************** -->
        <device Dname="STM32F411VC">
          <memory     id="IROM1"                             start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                             start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_256.FLM"   start="0x08000000"  size="0x40000"                  default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F401xx_OPT.FLM" start="0x1FFFC000"  size="0x04"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_OTP.FLM"   start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="81"/>
          <feature type="SPI"           n="5"       m="45000000"/>
          <feature type="SDIO"          n="1"       m="8"               name="Secure Digital IO"/>
          <variant Dvariant="STM32F411VCTx"> <feature type="QFP" n="100"/> </variant>
          <variant Dvariant="STM32F411VCHx"> <feature type="BGA" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F411CE'  ***************************** -->
        <device Dname="STM32F411CE">
          <memory     id="IROM1"                             start="0x08000000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                             start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_512.FLM"   start="0x08000000"  size="0x80000"                  default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F401xx_OPT.FLM" start="0x1FFFC000"  size="0x04"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_OTP.FLM"   start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="10"      m="12"/>
          <feature type="IOs"           n="36"/>
          <feature type="SPI"           n="5"       m="45000000"/>
          <feature type="SDIO"          n="1"       m="8"               name="Secure Digital IO"/>
          <variant Dvariant="STM32F411CEUx"> <feature type="QFP" n="48"/> </variant>
          <variant Dvariant="STM32F411CEYx"> <feature type="CSP" n="49"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F411RE'  ***************************** -->
        <device Dname="STM32F411RE">
          <memory     id="IROM1"                             start="0x08000000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                             start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_512.FLM"   start="0x08000000"  size="0x80000"                  default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F401xx_OPT.FLM" start="0x1FFFC000"  size="0x04"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_OTP.FLM"   start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="50"/>
          <feature type="SPI"           n="5"       m="45000000"/>
          <feature type="SDIO"          n="1"       m="8"               name="Secure Digital IO"/>
          <variant Dvariant="STM32F411RETx"> <feature type="QFP" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F411VE'  ***************************** -->
        <device Dname="STM32F411VE">
          <memory     id="IROM1"                             start="0x08000000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                             start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_512.FLM"   start="0x08000000"  size="0x80000"                  default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F401xx_OPT.FLM" start="0x1FFFC000"  size="0x04"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_OTP.FLM"   start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="81"/>
          <feature type="SPI"           n="5"       m="45000000"/>
          <feature type="SDIO"          n="1"       m="8"               name="Secure Digital IO"/>
          <variant Dvariant="STM32F411VETx"> <feature type="QFP" n="100"/> </variant>
          <variant Dvariant="STM32F411VEHx"> <feature type="BGA" n="100"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F412'  **************************** -->
      <subFamily DsubFamily="STM32F412">
        <processor Dclock="100000000"/>
        <debug svd="CMSIS/SVD/STM32F412xG.svd"/>
        <debugvars configfile="CMSIS/Debug/STM32F40x_41x_42x_43x.dbgconf">
          // Debug Access Variables, can be modified by user via copy of STM32F40x_41x_42x_43x.dbgconf created by uVision.
          __var DbgMCU_CR      = 0x00000007;   // DBGMCU_CR: DBG_SLEEP, DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz = 0x00000000;   // DGBMCU_APB1_FZ
          __var DbgMCU_APB2_Fz = 0x00000000;   // DGBMCU_APB2_FZ
        </debugvars>
        <book name="Documentation/DM00180369.pdf" title="STM32F412 Reference Manual"/>
        <book name="Documentation/DM00213872.pdf" title="STM32F412 Data Sheet"/>
        <feature type="Timer"         n="12"      m="14"/>
        <feature type="SPI"           n="5"       m="37500000"/>
        <feature type="I2C"           n="3"/>
        <feature type="SDIO"          n="1"       m="8"               name="Secure Digital IO"/>
        <feature type="USART"         n="4"       m="10500000"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="USBOTG"        n="1"/>
        <feature type="CAN"           n="2"/>
        <feature type="VCC"           n="1.70"    m="3.60"/>

        <!-- *************************  Device 'STM32F412CE'  ***************************** -->
        <device Dname="STM32F412CE">
          <compile header="Drivers/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xx.h"  define="STM32F412Cx"/>
          <memory     id="IROM1"                                   start="0x08000000"  size="0x00080000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                                   start="0x20000000"  size="0x00040000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_512.FLM"         start="0x08000000"  size="0x00080000"                  default="1"/>
          <!--algorithm  name="CMSIS/Flash/STM32F40xxx_41xxx_OPT.FLM" start="0x1FFFC000"  size="0x00000004"                  default="0"/-->
          <algorithm  name="CMSIS/Flash/STM32F4xx_OTP.FLM"         start="0x1FFF7800"  size="0x00000210"                  default="0"/>
          <variant Dvariant="STM32F412CEUx"> <feature type="QFP" n="48"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F412CG'  ***************************** -->
        <device Dname="STM32F412CG">
          <compile header="Drivers/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xx.h"  define="STM32F412Cx"/>
          <memory     id="IROM1"                                   start="0x08000000"  size="0x00100000"   startup="1"    default="1"/>
          <memory     id="IRAM1"                                   start="0x20000000"  size="0x00040000"   init   ="0"    default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_1024.FLM"        start="0x08000000"  size="0x00100000"                  default="1"/>
          <!--algorithm  name="CMSIS/Flash/STM32F40xxx_41xxx_OPT.FLM" start="0x1FFFC000"  size="0x00000004"                  default="0"/-->
          <algorithm  name="CMSIS/Flash/STM32F4xx_OTP.FLM"         start="0x1FFF7800"  size="0x00000210"                  default="0"/>
          <variant Dvariant="STM32F412CGUx"> <feature type="QFP" n="48"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F412RE'  ***************************** -->
        <device Dname="STM32F412RE">
          <compile header="Drivers/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xx.h"  define="STM32F412Rx"/>
          <memory     id="IROM1"                                   start="0x08000000"  size="0x00080000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                                   start="0x20000000"  size="0x00040000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_512.FLM"         start="0x08000000"  size="0x00080000"                  default="1"/>
          <!--algorithm  name="CMSIS/Flash/STM32F40xxx_41xxx_OPT.FLM" start="0x1FFFC000"  size="0x00000004"                  default="0"/-->
          <algorithm  name="CMSIS/Flash/STM32F4xx_OTP.FLM"         start="0x1FFF7800"  size="0x00000210"                  default="0"/>
          <variant Dvariant="STM32F412RETx"> <feature type="QFP" n="64"/> </variant>
          <variant Dvariant="STM32F412REYx"> <feature type="CSP" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F412RG'  ***************************** -->
        <device Dname="STM32F412RG">
          <compile header="Drivers/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xx.h"  define="STM32F412Rx"/>
          <memory     id="IROM1"                                   start="0x08000000"  size="0x00100000"   startup="1"    default="1"/>
          <memory     id="IRAM1"                                   start="0x20000000"  size="0x00040000"   init   ="0"    default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_1024.FLM"        start="0x08000000"  size="0x00100000"                  default="1"/>
          <!--algorithm  name="CMSIS/Flash/STM32F40xxx_41xxx_OPT.FLM" start="0x1FFFC000"  size="0x00000004"                  default="0"/-->
          <algorithm  name="CMSIS/Flash/STM32F4xx_OTP.FLM"         start="0x1FFF7800"  size="0x00000210"                  default="0"/>
          <variant Dvariant="STM32F412RGTx"> <feature type="QFP" n="64"/> </variant>
          <variant Dvariant="STM32F412RGYx"> <feature type="CSP" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F412VE'  ***************************** -->
        <device Dname="STM32F412VE">
          <compile header="Drivers/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xx.h"  define="STM32F412Vx"/>
          <memory     id="IROM1"                                   start="0x08000000"  size="0x00080000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                                   start="0x20000000"  size="0x00040000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_512.FLM"         start="0x08000000"  size="0x00080000"                  default="1"/>
          <!--algorithm  name="CMSIS/Flash/STM32F40xxx_41xxx_OPT.FLM" start="0x1FFFC000"  size="0x00000004"                  default="0"/-->
          <algorithm  name="CMSIS/Flash/STM32F4xx_OTP.FLM"         start="0x1FFF7800"  size="0x00000210"                  default="0"/>
          <variant Dvariant="STM32F412VEHx"> <feature type="BGA" n="100"/> </variant>
          <variant Dvariant="STM32F412VETx"> <feature type="QFP" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F412VG'  ***************************** -->
        <device Dname="STM32F412VG">
          <compile header="Drivers/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xx.h"  define="STM32F412Vx"/>
          <memory     id="IROM1"                                   start="0x08000000"  size="0x00100000"   startup="1"    default="1"/>
          <memory     id="IRAM1"                                   start="0x20000000"  size="0x00040000"   init   ="0"    default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_1024.FLM"        start="0x08000000"  size="0x00100000"                  default="1"/>
          <!--algorithm  name="CMSIS/Flash/STM32F40xxx_41xxx_OPT.FLM" start="0x1FFFC000"  size="0x00000004"                  default="0"/-->
          <algorithm  name="CMSIS/Flash/STM32F4xx_OTP.FLM"         start="0x1FFF7800"  size="0x00000210"                  default="0"/>
          <variant Dvariant="STM32F412VGHx"> <feature type="BGA" n="100"/> </variant>
          <variant Dvariant="STM32F412VGTx"> <feature type="QFP" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F412ZE'  ***************************** -->
        <device Dname="STM32F412ZE">
          <compile header="Drivers/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xx.h"  define="STM32F412Zx"/>
          <memory     id="IROM1"                                   start="0x08000000"  size="0x00080000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                                   start="0x20000000"  size="0x00040000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_512.FLM"         start="0x08000000"  size="0x00080000"                  default="1"/>
          <!--algorithm  name="CMSIS/Flash/STM32F40xxx_41xxx_OPT.FLM" start="0x1FFFC000"  size="0x00000004"                  default="0"/-->
          <algorithm  name="CMSIS/Flash/STM32F4xx_OTP.FLM"         start="0x1FFF7800"  size="0x00000210"                  default="0"/>
          <variant Dvariant="STM32F412ZEJx"> <feature type="BGA" n="144"/> </variant>
          <variant Dvariant="STM32F412ZETx"> <feature type="QFP" n="144"/> </variant>
        </device>

