taboadaa/ShuQi/nRF/Packages/.cache/Keil.STM32F4xx_DFP.2.11.0.pdsc
        <!-- *************************  Device 'STM32F427AG'  ***************************** -->
        <device Dname="STM32F427AG">
          <memory     id="IROM1"                                   start="0x08000000"  size="0x100000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                                   start="0x20000000"  size="0x30000"    init   ="0"   default="1"/>
          <memory     id="IRAM2"                                   start="0x10000000"  size="0x10000"    init   ="0"   default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_1024.FLM"        start="0x08000000"  size="0x100000"                 default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F42xxx_43xxx_OPT.FLM" start="0x1FFFC000"  size="0x08"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_OTP.FLM"         start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="130"/>
          <variant Dvariant="STM32F427AGHx"> <feature type="BGA" n="169"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F427VG'  ***************************** -->
        <device Dname="STM32F427VG">
          <memory     id="IROM1"                                   start="0x08000000"  size="0x100000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                                   start="0x20000000"  size="0x30000"    init   ="0"   default="1"/>
          <memory     id="IRAM2"                                   start="0x10000000"  size="0x10000"    init   ="0"   default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_1024.FLM"        start="0x08000000"  size="0x100000"                 default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F42xxx_43xxx_OPT.FLM" start="0x1FFFC000"  size="0x08"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_OTP.FLM"         start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="82"/>
          <variant Dvariant="STM32F427VGTx"> <feature type="QFP" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F427ZG'  ***************************** -->
        <device Dname="STM32F427ZG">
          <memory     id="IROM1"                                   start="0x08000000"  size="0x100000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                                   start="0x20000000"  size="0x30000"    init   ="0"   default="1"/>
          <memory     id="IRAM2"                                   start="0x10000000"  size="0x10000"    init   ="0"   default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_1024.FLM"        start="0x08000000"  size="0x100000"                 default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F42xxx_43xxx_OPT.FLM" start="0x1FFFC000"  size="0x08"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_OTP.FLM"         start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="24"      m="12"/>
          <feature type="IOs"           n="114"/>
          <variant Dvariant="STM32F427ZGTx"> <feature type="QFP" n="144"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F427IG'  ***************************** -->
        <device Dname="STM32F427IG">
          <memory     id="IROM1"                                   start="0x08000000"  size="0x100000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                                   start="0x20000000"  size="0x30000"    init   ="0"   default="1"/>
          <memory     id="IRAM2"                                   start="0x10000000"  size="0x10000"    init   ="0"   default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_1024.FLM"        start="0x08000000"  size="0x100000"                 default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F42xxx_43xxx_OPT.FLM" start="0x1FFFC000"  size="0x08"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_OTP.FLM"         start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="24"      m="12"/>
          <feature type="IOs"           n="140"/>
          <variant Dvariant="STM32F427IGTx"> <feature type="QFP" n="176"/> </variant>
          <variant Dvariant="STM32F427IGHx"> <feature type="BGA" n="176"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F427AI'  ***************************** -->
        <device Dname="STM32F427AI">
          <memory     id="IROM1"                                   start="0x08000000"  size="0x200000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                                   start="0x20000000"  size="0x30000"    init   ="0"   default="1"/>
          <memory     id="IRAM2"                                   start="0x10000000"  size="0x10000"    init   ="0"   default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_2048.FLM"        start="0x08000000"  size="0x200000"                 default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F42xxx_43xxx_OPT.FLM" start="0x1FFFC000"  size="0x08"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_OTP.FLM"         start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="130"/>
          <variant Dvariant="STM32F427AIHx"> <feature type="BGA" n="169"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F427VI'  ***************************** -->
        <device Dname="STM32F427VI">
          <memory     id="IROM1"                                   start="0x08000000"  size="0x200000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                                   start="0x20000000"  size="0x30000"    init   ="0"   default="1"/>
          <memory     id="IRAM2"                                   start="0x10000000"  size="0x10000"    init   ="0"   default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_2048.FLM"        start="0x08000000"  size="0x200000"                 default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F42xxx_43xxx_OPT.FLM" start="0x1FFFC000"  size="0x08"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_OTP.FLM"         start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="82"/>
          <variant Dvariant="STM32F427VITx"> <feature type="QFP" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F427ZI'  ***************************** -->
        <device Dname="STM32F427ZI">
          <memory     id="IROM1"                                   start="0x08000000"  size="0x200000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                                   start="0x20000000"  size="0x30000"    init   ="0"   default="1"/>
          <memory     id="IRAM2"                                   start="0x10000000"  size="0x10000"    init   ="0"   default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_2048.FLM"        start="0x08000000"  size="0x200000"                 default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F42xxx_43xxx_OPT.FLM" start="0x1FFFC000"  size="0x08"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_OTP.FLM"         start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="24"      m="12"/>
          <feature type="IOs"           n="114"/>
          <variant Dvariant="STM32F427ZITx"> <feature type="QFP" n="144"/> </variant>
        </device>

