taboadaa/ShuQi/nRF/Packages/.cache/Keil.STM32F4xx_DFP.2.11.0.pdsc
        <!-- *************************  Device 'STM32F439BG'  ***************************** -->
        <device Dname="STM32F439BG">
          <memory     id="IROM1"                                   start="0x08000000"  size="0x100000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                                   start="0x20000000"  size="0x30000"    init   ="0"   default="1"/>
          <memory     id="IRAM2"                                   start="0x10000000"  size="0x10000"    init   ="0"   default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_1024.FLM"        start="0x08000000"  size="0x100000"                 default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F42xxx_43xxx_OPT.FLM" start="0x1FFFC000"  size="0x08"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_OTP.FLM"         start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="24"      m="12"/>
          <feature type="IOs"           n="168"/>
          <variant Dvariant="STM32F439BGTx"> <feature type="QFP" n="208"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F439BI'  ***************************** -->
        <device Dname="STM32F439BI">
          <memory     id="IROM1"                                   start="0x08000000"  size="0x200000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                                   start="0x20000000"  size="0x30000"    init   ="0"   default="1"/>
          <memory     id="IRAM2"                                   start="0x10000000"  size="0x10000"    init   ="0"   default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_2048.FLM"        start="0x08000000"  size="0x200000"                 default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F42xxx_43xxx_OPT.FLM" start="0x1FFFC000"  size="0x08"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_OTP.FLM"         start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="24"      m="12"/>
          <feature type="IOs"           n="168"/>
          <variant Dvariant="STM32F439BITx"> <feature type="QFP" n="208"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F439NG'  ***************************** -->
        <device Dname="STM32F439NG">
          <memory     id="IROM1"                                   start="0x08000000"  size="0x100000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                                   start="0x20000000"  size="0x30000"    init   ="0"   default="1"/>
          <memory     id="IRAM2"                                   start="0x10000000"  size="0x10000"    init   ="0"   default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_1024.FLM"        start="0x08000000"  size="0x100000"                 default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F42xxx_43xxx_OPT.FLM" start="0x1FFFC000"  size="0x08"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_OTP.FLM"         start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="24"      m="12"/>
          <feature type="IOs"           n="168"/>
          <variant Dvariant="STM32F439NGHx"> <feature type="BGA" n="216"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F439NI'  ***************************** -->
        <device Dname="STM32F439NI">
          <memory     id="IROM1"                                   start="0x08000000"  size="0x200000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                                   start="0x20000000"  size="0x30000"    init   ="0"   default="1"/>
          <memory     id="IRAM2"                                   start="0x10000000"  size="0x10000"    init   ="0"   default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_2048.FLM"        start="0x08000000"  size="0x200000"                 default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F42xxx_43xxx_OPT.FLM" start="0x1FFFC000"  size="0x08"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_OTP.FLM"         start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="24"      m="12"/>
          <feature type="IOs"           n="168"/>
          <variant Dvariant="STM32F439NIHx"> <feature type="BGA" n="216"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F439AI'  ***************************** -->
        <device Dname="STM32F439AI">
          <memory     id="IROM1"                                   start="0x08000000"  size="0x200000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                                   start="0x20000000"  size="0x30000"    init   ="0"   default="1"/>
          <memory     id="IRAM2"                                   start="0x10000000"  size="0x10000"    init   ="0"   default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_2048.FLM"        start="0x08000000"  size="0x200000"                 default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F42xxx_43xxx_OPT.FLM" start="0x1FFFC000"  size="0x08"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_OTP.FLM"         start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="24"      m="12"/>
          <feature type="IOs"           n="130"/>
          <variant Dvariant="STM32F439AIHx"> <feature type="BGA" n="169"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F446'  **************************** -->
      <subFamily DsubFamily="STM32F446">
       <processor Dclock="180000000"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xx.h"  define="STM32F446xx"/>
        <debug      svd="CMSIS/SVD/STM32F446x.svd"/>
        <debugvars configfile="CMSIS/Debug/STM32F40x_41x_42x_43x.dbgconf">
          // Debug Access Variables, can be modified by user via copy of STM32F401xBCDE_411xCE.dbgconf created by uVision.
          __var DbgMCU_CR      = 0x00000007;   // DBGMCU_CR: DBG_SLEEP, DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz = 0x00000000;   // DGBMCU_APB1_FZ: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
        </debugvars>
        <book name="Documentation/DM00135183.pdf" title="STM32F446 Reference Manual"/>
        <book name="Documentation/DM00141306.pdf" title="STM32F446 Data Sheet"/>
        <book name="Documentation/DM00155929.pdf" title="STM32F446 Errata Sheet"/>
        <feature type="Timer"         n="12"      m="16"/>
        <feature type="DAC"           n="2"       m="12"/>
        <feature type="SPI"           n="4"       m="45000000"/>
        <feature type="ComOther"      n="2"                           name="SAI Interface"/>
        <feature type="I2C"           n="3"/>
        <feature type="USART"         n="4"       m="11250000"/>
        <feature type="UART"          n="2"       m="11250000"/>
        <feature type="USBOTG"        n="1"/>
        <feature type="CAN"           n="2"/>
        <feature type="SDIO"          n="1"       m="8"               name="Secure Digital IO"/>
        <feature type="SPI"           n="1"       m="42000000"        name="Queued Serial Peripheral Interface"/>
        <feature type="VCC"           n="1.80"    m="3.60"/>
        <feature type="Camera"        n="1"       m="14"/>

        <!-- *************************  Device 'STM32F446MC'  ***************************** -->
        <device Dname="STM32F446MC">
          <memory     id="IROM1"                                   start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                                   start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_256.FLM"         start="0x08000000"  size="0x40000"                  default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_OTP.FLM"         start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <variant Dvariant="STM32F446MCYx"> <feature type="QFP" n="100"/> </variant>
        </device>

