taboadaa/ShuQi/nRF/Packages/.cache/Keil.STM32F4xx_DFP.2.11.0.pdsc
    <condition id="STM32F42_43_44_46_47x">
      <description>STMicroelectronics STM32F427/429/437/439/446/469/479 Series devices</description>
      <accept  condition="STM32F427xx"/>
      <accept  condition="STM32F429xx"/>
      <accept  condition="STM32F437xx"/>
      <accept  condition="STM32F439xx"/>
      <accept  condition="STM32F446xx"/>
      <accept  condition="STM32F469xx"/>
      <accept  condition="STM32F479xx"/>
    </condition>
    <condition id="STM32F42_43_44_46_47x_4x3">
      <description>STMicroelectronics STM32F427/429/437/439/446/469/479/413/423 Series devices</description>
      <accept  condition="STM32F427xx"/>
      <accept  condition="STM32F429xx"/>
      <accept  condition="STM32F437xx"/>
      <accept  condition="STM32F439xx"/>
      <accept  condition="STM32F446xx"/>
      <accept  condition="STM32F469xx"/>
      <accept  condition="STM32F479xx"/>
      <accept  condition="STM32F413xx"/>
      <accept  condition="STM32F423xx"/>
    </condition>
    <condition id="STM32F42_43_46_47x">
      <description>STMicroelectronics STM32F427/429/437/439/469/479 Series devices</description>
      <accept  condition="STM32F427xx"/>
      <accept  condition="STM32F429xx"/>
      <accept  condition="STM32F437xx"/>
      <accept  condition="STM32F439xx"/>
      <accept  condition="STM32F469xx"/>
      <accept  condition="STM32F479xx"/>
    </condition>
    <condition id="STM32F43_47x">
      <description>STMicroelectronics STM32F437/439/479 Series devices</description>
      <accept  condition="STM32F437xx"/>
      <accept  condition="STM32F439xx"/>
      <accept  condition="STM32F479xx"/>
    </condition>
    <condition id="STM32F44_46_47x">
      <description>STMicroelectronics STM32F446/469/479 Series devices</description>
      <accept  condition="STM32F446xx"/>
      <accept  condition="STM32F469xx"/>
      <accept  condition="STM32F479xx"/>
    </condition>
    <condition id="STM32F412_44_46_47x">
      <description>STMicroelectronics STM32F412/446/469/479 Series devices</description>
      <accept  condition="STM32F412xx"/>
      <accept  condition="STM32F446xx"/>
      <accept  condition="STM32F469xx"/>
      <accept  condition="STM32F479xx"/>
    </condition>
    <condition id="STM32F412_44_46_47x_4x3">
      <description>STMicroelectronics STM32F412/446/469/479/413/423 Series devices</description>
      <accept  condition="STM32F412xx"/>
      <accept  condition="STM32F446xx"/>
      <accept  condition="STM32F469xx"/>
      <accept  condition="STM32F479xx"/>
      <accept  condition="STM32F413xx"/>
      <accept  condition="STM32F423xx"/>
    </condition>
    <condition id="STM32F46_47x">
      <description>STMicroelectronics STM32F469/479 Series devices</description>
      <accept  condition="STM32F469xx"/>
      <accept  condition="STM32F479xx"/>
    </condition>
    <condition id="STM32F4x7_9">
      <description>STMicroelectronics STM32F417/427/429/437/439/469/479 Series devices</description>
      <accept  condition="STM32F407xx"/>
      <accept  condition="STM32F417xx"/>
      <accept  condition="STM32F427xx"/>
      <accept  condition="STM32F429xx"/>
      <accept  condition="STM32F437xx"/>
      <accept  condition="STM32F439xx"/>
      <accept  condition="STM32F469xx"/>
      <accept  condition="STM32F479xx"/>
    </condition>
    <condition id="STM32F4x7_9_6">
      <description>STMicroelectronics STM32F417/427/429/437/439/446/469/479 Series devices</description>
      <accept  condition="STM32F407xx"/>
      <accept  condition="STM32F417xx"/>
      <accept  condition="STM32F427xx"/>
      <accept  condition="STM32F429xx"/>
      <accept  condition="STM32F437xx"/>
      <accept  condition="STM32F439xx"/>
      <accept  condition="STM32F446xx"/>
      <accept  condition="STM32F469xx"/>
      <accept  condition="STM32F479xx"/>
    </condition>
    <condition id="STM32F4x9">
      <description>STMicroelectronics STM32F429/439/469/479 Series devices</description>
      <accept  condition="STM32F429xx"/>
      <accept  condition="STM32F439xx"/>
      <accept  condition="STM32F469xx"/>
      <accept  condition="STM32F479xx"/>
    </condition>
    <condition id="STM32F4x1_40_41_42_43_44_46_47x">
      <description>STMicroelectronics STM32F401/411/405/407/415/417/427/429/437/439/446/469/479 Series devices</description>
      <accept  condition="STM32F401xC"/>
      <accept  condition="STM32F401xE"/>
      <accept  condition="STM32F411xE"/>
      <accept  condition="STM32F405xx"/>
      <accept  condition="STM32F407xx"/>
      <accept  condition="STM32F415xx"/>
      <accept  condition="STM32F417xx"/>
      <accept  condition="STM32F427xx"/>
      <accept  condition="STM32F429xx"/>
      <accept  condition="STM32F437xx"/>
      <accept  condition="STM32F439xx"/>
      <accept  condition="STM32F446xx"/>
      <accept  condition="STM32F469xx"/>
      <accept  condition="STM32F479xx"/>
    </condition>
    <condition id="STM32F4x1_40_41_412_42_43_44_46_47x">
      <description>STMicroelectronics STM32F401/411/405/407/412/415/417/427/429/437/439/446/469/479 Series devices</description>
      <accept  condition="STM32F401xC"/>
      <accept  condition="STM32F401xE"/>
      <accept  condition="STM32F411xE"/>
      <accept  condition="STM32F405xx"/>
      <accept  condition="STM32F407xx"/>
      <accept  condition="STM32F412xx"/>
      <accept  condition="STM32F415xx"/>
      <accept  condition="STM32F417xx"/>
      <accept  condition="STM32F427xx"/>
      <accept  condition="STM32F429xx"/>
      <accept  condition="STM32F437xx"/>
      <accept  condition="STM32F439xx"/>
      <accept  condition="STM32F446xx"/>
      <accept  condition="STM32F469xx"/>
      <accept  condition="STM32F479xx"/>
    </condition>
    <condition id="STM32F4x1_40_41_412_42_43_44_46_47x_4x3">
      <description>STMicroelectronics STM32F401/411/405/407/412/415/417/427/429/437/439/446/469/479/413/423 Series devices</description>
      <accept  condition="STM32F401xC"/>
      <accept  condition="STM32F401xE"/>
      <accept  condition="STM32F411xE"/>
      <accept  condition="STM32F405xx"/>
      <accept  condition="STM32F407xx"/>
      <accept  condition="STM32F412xx"/>
      <accept  condition="STM32F415xx"/>
      <accept  condition="STM32F417xx"/>
      <accept  condition="STM32F427xx"/>
      <accept  condition="STM32F429xx"/>
      <accept  condition="STM32F437xx"/>
      <accept  condition="STM32F439xx"/>
      <accept  condition="STM32F446xx"/>
      <accept  condition="STM32F469xx"/>
      <accept  condition="STM32F479xx"/>
      <accept  condition="STM32F413xx"/>
      <accept  condition="STM32F423xx"/>
    </condition>
    <condition id="STM32F4x1_42_43_44_46_47x">
      <description>STMicroelectronics STM32F401/411/427/429/437/439/446/469/479 Series devices</description>
      <accept  condition="STM32F401xC"/>
      <accept  condition="STM32F401xE"/>
      <accept  condition="STM32F411xE"/>
      <accept  condition="STM32F427xx"/>
      <accept  condition="STM32F429xx"/>
      <accept  condition="STM32F437xx"/>
      <accept  condition="STM32F439xx"/>
      <accept  condition="STM32F446xx"/>
      <accept  condition="STM32F469xx"/>
      <accept  condition="STM32F479xx"/>
    </condition>
    <condition id="STM32F4x1_42_43_44_46_47x_4x3">
      <description>STMicroelectronics STM32F401/411/427/429/437/439/446/469/479/413/423 Series devices</description>
      <accept  condition="STM32F401xC"/>
      <accept  condition="STM32F401xE"/>
      <accept  condition="STM32F411xE"/>
      <accept  condition="STM32F427xx"/>
      <accept  condition="STM32F429xx"/>
      <accept  condition="STM32F437xx"/>
      <accept  condition="STM32F439xx"/>
      <accept  condition="STM32F446xx"/>
      <accept  condition="STM32F469xx"/>
      <accept  condition="STM32F479xx"/>
      <accept  condition="STM32F413xx"/>
      <accept  condition="STM32F423xx"/>
    </condition>
    <condition id="STM32F410_411_446">
      <description>STMicroelectronics STM32F410/411/446 Series devices</description>
      <accept  condition="STM32F410xx"/>
      <accept  condition="STM32F411xE"/>
      <accept  condition="STM32F446xx"/>
    </condition>
