taboadaa/ShuQi/nRF/Packages/.cache/Keil.STM32F4xx_DFP.2.11.0.pdsc
    <condition id="STM32F410Rx_ARMCC">
      <description>filter for STM32F410Rx devices and the ARM compiler</description>
      <require condition="STM32F410Rx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F410Rx_GCC">
      <description>filter for STM32F410Rx devices and the GCC compiler</description>
      <require condition="STM32F410Rx"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F410Rx_IAR">
      <description>filter for STM32F410Rx devices and the IAR compiler</description>
      <require condition="STM32F410Rx"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F410Tx_ARMCC">
      <description>filter for STM32F410Tx devices and the ARM compiler</description>
      <require condition="STM32F410Tx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F410Tx_GCC">
      <description>filter for STM32F410Tx devices and the GCC compiler</description>
      <require condition="STM32F410Tx"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F410Tx_IAR">
      <description>filter for STM32F410Tx devices and the IAR compiler</description>
      <require condition="STM32F410Tx"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F411xE_ARMCC">
      <description>filter for STM32F411xC/E devices and the ARM compiler</description>
      <require condition="STM32F411xE"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F411xE_GCC">
      <description>filter for STM32F411xC/E devices and the GCC compiler</description>
      <require condition="STM32F411xE"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F411xE_IAR">
      <description>filter for STM32F411xC/E devices and the IAR compiler</description>
      <require condition="STM32F411xE"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F412Cx_ARMCC">
      <description>filter for STM32F412Cx devices and the ARM compiler</description>
      <require condition="STM32F412Cx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F412Cx_GCC">
      <description>filter for STM32F412Cx devices and the GCC compiler</description>
      <require condition="STM32F412Cx"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F412Cx_IAR">
      <description>filter for STM32F412Cx devices and the IAR compiler</description>
      <require condition="STM32F412Cx"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F412Rx_ARMCC">
      <description>filter for STM32F412Rx devices and the ARM compiler</description>
      <require condition="STM32F412Rx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F412Rx_GCC">
      <description>filter for STM32F412Rx devices and the GCC compiler</description>
      <require condition="STM32F412Rx"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F412Rx_IAR">
      <description>filter for STM32F412Rx devices and the IAR compiler</description>
      <require condition="STM32F412Rx"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F412Vx_ARMCC">
      <description>filter for STM32F412Vx devices and the ARM compiler</description>
      <require condition="STM32F412Vx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F412Vx_GCC">
      <description>filter for STM32F412Vx devices and the GCC compiler</description>
      <require condition="STM32F412Vx"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F412Vx_IAR">
      <description>filter for STM32F412Vx devices and the IAR compiler</description>
      <require condition="STM32F412Vx"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F412Zx_ARMCC">
      <description>filter for STM32F412Zx devices and the ARM compiler</description>
      <require condition="STM32F412Zx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F412Zx_GCC">
      <description>filter for STM32F412Zx devices and the GCC compiler</description>
      <require condition="STM32F412Zx"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F412Zx_IAR">
      <description>filter for STM32F412Zx devices and the IAR compiler</description>
      <require condition="STM32F412Zx"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F405xx_ARMCC">
      <description>filter for STM32F405xx devices and the ARM compiler</description>
      <require condition="STM32F405xx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F405xx_GCC">
      <description>filter for STM32F405xx devices and the GCC compiler</description>
      <require condition="STM32F405xx"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F405xx_IAR">
      <description>filter for STM32F405xx devices and the IAR compiler</description>
      <require condition="STM32F405xx"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F407xx_ARMCC">
      <description>filter for STM32F407xx devices and the ARM compiler</description>
      <require condition="STM32F407xx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F407xx_GCC">
      <description>filter for STM32F407xx devices and the GCC compiler</description>
      <require condition="STM32F407xx"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F407xx_IAR">
      <description>filter for STM32F407xx devices and the IAR compiler</description>
      <require condition="STM32F407xx"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F415xx_ARMCC">
      <description>filter for STM32F415xx devices and the ARM compiler</description>
      <require condition="STM32F415xx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F415xx_GCC">
      <description>filter for STM32F415xx devices and the GCC compiler</description>
      <require condition="STM32F415xx"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F415xx_IAR">
      <description>filter for STM32F415xx devices and the IAR compiler</description>
      <require condition="STM32F415xx"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F417xx_ARMCC">
      <description>filter for STM32F417xx devices and the ARM compiler</description>
      <require condition="STM32F417xx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F417xx_GCC">
      <description>filter for STM32F417xx devices and the GCC compiler</description>
      <require condition="STM32F417xx"/>
      <require Tcompiler="GCC"/>
    </condition>
