taboadaa/ShuQi/nRF/Packages/.cache/Keil.STM32F4xx_DFP.2.11.0.pdsc
    <condition id="STM32F417xx_IAR">
      <description>filter for STM32F417xx devices and the IAR compiler</description>
      <require condition="STM32F417xx"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F427xx_ARMCC">
      <description>filter for STM32F427xx devices and the ARM compiler</description>
      <require condition="STM32F427xx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F427xx_GCC">
      <description>filter for STM32F427xx devices and the GCC compiler</description>
      <require condition="STM32F427xx"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F427xx_IAR">
      <description>filter for STM32F427xx devices and the IAR compiler</description>
      <require condition="STM32F427xx"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F429xx_ARMCC">
      <description>filter for STM32F429xx devices and the ARM compiler</description>
      <require condition="STM32F429xx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F429xx_GCC">
      <description>filter for STM32F429xx devices and the GCC compiler</description>
      <require condition="STM32F429xx"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F429xx_IAR">
      <description>filter for STM32F429xx devices and the IAR compiler</description>
      <require condition="STM32F429xx"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F437xx_ARMCC">
      <description>filter for STM32F437xx devices and the ARM compiler</description>
      <require condition="STM32F437xx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F437xx_GCC">
      <description>filter for STM32F437xx devices and the GCC compiler</description>
      <require condition="STM32F437xx"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F437xx_IAR">
      <description>filter for STM32F437xx devices and the IAR compiler</description>
      <require condition="STM32F437xx"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F439xx_ARMCC">
      <description>filter for STM32F439xx devices and the ARM compiler</description>
      <require condition="STM32F439xx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F439xx_GCC">
      <description>filter for STM32F439xx devices and the GCC compiler</description>
      <require condition="STM32F439xx"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F439xx_IAR">
      <description>filter for STM32F439xx devices and the IAR compiler</description>
      <require condition="STM32F439xx"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F446xx_ARMCC">
      <description>filter for STM32F446xx devices and the ARM compiler</description>
      <require condition="STM32F446xx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F446xx_GCC">
      <description>filter for STM32F446xx devices and the GCC compiler</description>
      <require condition="STM32F446xx"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F446xx_IAR">
      <description>filter for STM32F446xx devices and the IAR compiler</description>
      <require condition="STM32F446xx"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F469xx_ARMCC">
      <description>filter for STM32F469xx devices and the ARM compiler</description>
      <require condition="STM32F469xx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F469xx_GCC">
      <description>filter for STM32F469xx devices and the GCC compiler</description>
      <require condition="STM32F469xx"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F469xx_IAR">
      <description>filter for STM32F469xx devices and the IAR compiler</description>
      <require condition="STM32F469xx"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F479xx_ARMCC">
      <description>filter for STM32F479xx devices and the ARM compiler</description>
      <require condition="STM32F479xx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F479xx_GCC">
      <description>filter for STM32F479xx devices and the GCC compiler</description>
      <require condition="STM32F479xx"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F479xx_IAR">
      <description>filter for STM32F479xx devices and the IAR compiler</description>
      <require condition="STM32F479xx"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F413xx_ARMCC">
      <description>filter for STM32F413xx devices and the ARM compiler</description>
      <require condition="STM32F413xx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F413xx_GCC">
      <description>filter for STM32F413xx devices and the GCC compiler</description>
      <require condition="STM32F413xx"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F413xx_IAR">
      <description>filter for STM32F413xx devices and the IAR compiler</description>
      <require condition="STM32F413xx"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F423xx_ARMCC">
      <description>filter for STM32F423xx devices and the ARM compiler</description>
      <require condition="STM32F423xx"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F423xx_GCC">
      <description>filter for STM32F423xx devices and the GCC compiler</description>
      <require condition="STM32F423xx"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F423xx_IAR">
      <description>filter for STM32F413xx devices and the IAR compiler</description>
      <require condition="STM32F423xx"/>
      <require Tcompiler="IAR"/>
    </condition>


