taboadaa/ShuQi/nRF/Packages/.cache/Keil.STM32F4xx_DFP.2.11.0.pdsc
    <condition id="STM32F4 CMSIS">
      <description>STMicroelectronics STM32F4 Device and CMSIS-CORE</description>
      <require condition="STM32F4"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32F4 CMSIS RTOS">
      <description>STMicroelectronics STM32F4 Device and CMSIS-CORE with RTOS</description>
      <require condition="STM32F4"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="CMSIS" Cgroup="RTOS"/>
    </condition>
    <condition id="STM32F4 CMSIS RTOS I2C_Driver">
      <description>STMicroelectronics STM32F4 Device and CMSIS-CORE with RTOS and I2C Driver</description>
      <require condition="STM32F4"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="CMSIS" Cgroup="RTOS"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C"/>
    </condition>
    <condition id="STM32F4 CMSIS I2C_Driver">
      <description>STMicroelectronics STM32F4 Device and CMSIS-CORE with I2C Driver</description>
      <require condition="STM32F4"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C"/>
    </condition>

    <condition id="STM32F4 Framework Classic">
      <description>STM32CubeF4 Classic Framework</description>
      <require condition="STM32F4 HAL Common"/>
    </condition>

    <condition id="STM32F4 HAL Common">
      <description>STMicroelectronics STM32F4 Device and HAL Common</description>
      <require condition="STM32F4"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="STM32Cube Framework"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Cortex"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="RCC"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="PWR"/>
    </condition>

    <condition id="STM32F4 HAL">
      <description>STMicroelectronics STM32F4 Device and HAL</description>
      <require condition="STM32F4"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
    <condition id="STM32F40_41_42_43x HAL">
      <description>STMicroelectronics STM32F405/407/415/417/427/429/437/439 Device and HAL</description>
      <require condition="STM32F40_41_42_43x"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
    <condition id="STM32F40_41_42_43_44_46_47x HAL">
      <description>STMicroelectronics STM32F405/407/415/417/427/429/437/439/446/469/479 Device and HAL</description>
      <require condition="STM32F40_41_42_43_44_46_47x"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
    <condition id="STM32F40_41_412_42_43_44_46_47x HAL">
      <description>STMicroelectronics STM32F405/407/412/415/417/427/429/437/439/446/469/479 Device and HAL</description>
      <require condition="STM32F40_41_412_42_43_44_46_47x"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
    <condition id="STM32F40_41_412_42_43_44_46_47x_4x3 HAL">
      <description>STMicroelectronics STM32F405/407/412/415/417/427/429/437/439/446/469/479/413/423 Device and HAL</description>
      <require condition="STM32F40_41_412_42_43_44_46_47x_4x3"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
    <condition id="STM32F42_43x HAL">
      <description>STMicroelectronics STM32F427/429/437/439 Device and HAL</description>
      <require condition="STM32F42_43x"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
    <condition id="STM32F42_43_46_47x HAL">
      <description>STMicroelectronics STM32F427/429/437/439/469/479 Device and HAL</description>
      <require condition="STM32F42_43_46_47x"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
    <condition id="STM32F46_47x HAL">
      <description>STMicroelectronics STM32F469/479 Series Device and HAL</description>
      <require condition="STM32F46_47x"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
    <condition id="STM32F4x7_9 HAL">
      <description>STMicroelectronics STM32F417/427/429/437/439/469/479 Device and HAL</description>
      <require condition="STM32F4x7_9"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
    <condition id="STM32F4x9 HAL">
      <description>STMicroelectronics STM32F429/439/469/479 Device and HAL</description>
      <require condition="STM32F4x9"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
    <condition id="STM32F446 HAL">
      <description>STMicroelectronics STM32F446 Device and HAL</description>
      <require condition="STM32F446xx"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
    <condition id="STM32F4x1_40_41_42_43_44_46_47x HAL">
      <description>STMicroelectronics STM32F401/411/405/407/415/417/427/429/437/439/446/469/479 Device and HAL</description>
      <require condition="STM32F4x1_40_41_42_43_44_46_47x"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
    <condition id="STM32F4x1_40_41_412_42_43_44_46_47x HAL">
      <description>STMicroelectronics STM32F401/411/405/407/412/415/417/427/429/437/439/446/469/479 Device and HAL</description>
      <require condition="STM32F4x1_40_41_412_42_43_44_46_47x"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
    <condition id="STM32F4x1_40_41_412_42_43_44_46_47x_4x3 HAL">
      <description>STMicroelectronics STM32F401/411/405/407/412/415/417/427/429/437/439/446/469/479/413/423 Device and HAL</description>
      <require condition="STM32F4x1_40_41_412_42_43_44_46_47x_4x3"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
    <condition id="STM32F410 HAL">
      <description>STMicroelectronics STM32F410 Device and HAL</description>
      <require condition="STM32F410xx"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
    <condition id="STM32F410_4x3 HAL">
      <description>STMicroelectronics STM32F410/413/423 Device and HAL</description>
      <require condition="STM32F410_4x3"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
    <condition id="STM32F412 HAL">
      <description>STMicroelectronics STM32F412 Device and HAL</description>
      <require condition="STM32F412xx"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
    <condition id="STM32F412_4x3 HAL">
      <description>STMicroelectronics STM32F412/413/423 Device and HAL</description>
      <require condition="STM32F412_4x3"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
    <condition id="STM32F410_40_41_42_43_44_46_47x HAL">
      <description>STMicroelectronics STM32F410/405/407/415/417/427/429/437/439/446/469/479 Device and HAL</description>
      <require condition="STM32F410_40_41_42_43_44_46_47x"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
