taboadaa/ShuQi/nRF/Packages/.cache/Keil.STM32F4xx_DFP.2.11.0.pdsc
    <!-- STM32F429I-Discovery Board -->
    <bundle Cbundle="STM32F429I-Discovery" Cclass="Board Support" Cversion="1.0.0">
      <description>STMicroelectronics STM32F429I-Discovery Kit</description>
      <doc>http://www.st.com/st-web-ui/static/active/en/resource/technical/document/data_brief/DM00094498.pdf</doc>
      <component Cgroup="LED" Capiversion="1.00" condition="STM32F4 HAL GPIO">
        <description>LED Interface for STMicroelectronics STM32F429I-Discovery Kit</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32F429I-Discovery/Common/LED_F429Discovery.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.00" condition="STM32F4 HAL GPIO">
        <description>Buttons Interface for STMicroelectronics STM32F429I-Discovery Kit</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32F429I-Discovery/Common/Buttons_F429Discovery.c"/>
        </files>
      </component>
      <component Cgroup="Touchscreen" Capiversion="1.00" condition="STM32F4 CMSIS RTOS I2C_Driver">
        <description>Touchscreen Interface for STMPE811</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32F429I-Discovery/Common/Touch_STMPE811.c"/>
        </files>
      </component>
      <component Cgroup="emWin LCD" Capiversion="1.1" Cvariant="RGB IF" condition="STM32F4 HAL GPIO SPI_Driver LCD_RGB">
        <description>emWin LCD RGB Interface for STMicroelectronics STM32F429I-Discovery Kit</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32F429I-Discovery/Common/LCD_X.c"/>
        </files>
      </component>
    </bundle>

    <component Cclass="Graphics Display" Cgroup="STM32F429I-Discovery" Cvariant="RGB IF" Cversion="1.0.0" condition="STM32F4 HAL LTDC DMA2D Graphics LCD_RGB">
      <description>LCD Configuration for STM32F429I-Discovery LCD</description>
      <files>
          <file category="source" name="MDK/Boards/ST/STM32F429I-Discovery/Common/LCDConf.c" attr="config" version="1.0.0"/>
      </files>
    </component>
  </components>
</package>
